app/views/microposts/_micropost.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  </td>
  <% user = micropost.user rescue User.find(micropost.user_id) %>