app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("created_at", "photo_content_type", "photo_file_name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 11 Apr 2014 20:50:12 UTC +00:00], ["photo_content_type", "image/jpeg"], ["photo_file_name", nil], ["updated_at", Fri, 11 Apr 2014 20:50:12 UTC +00:00], ["user_id", 1]]
---
  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save